-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 13, 2025 at 12:28 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `foreign_trade`
--

-- --------------------------------------------------------

--
-- Table structure for table `companies`
--

CREATE TABLE `companies` (
  `id` int(11) NOT NULL,
  `company_name` varchar(50) NOT NULL,
  `company_type` varchar(255) NOT NULL,
  `address` text NOT NULL,
  `contact_number` text NOT NULL,
  `parent_id` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `companies`
--

INSERT INTO `companies` (`id`, `company_name`, `company_type`, `address`, `contact_number`, `parent_id`) VALUES
(1, 'ADURY FASHION & PRINT LTD ', 'Single', 'Add Later', 'Add Later', 0),
(2, 'Advance Com  Tex  Ltd ', 'Single', 'Add Later', 'Add Later', 0),
(3, 'AINUN TRADE HOUSE LTD', 'Single', 'Add Later', 'Add Later', 58),
(4, 'ANTIM KNITING &  DYING  ', 'Single', 'Add Later', 'Add Later', 0),
(5, 'Aristocrate  Non Woven Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(6, 'Aristocrate Agro  Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(7, 'Asiatic Textile Mills Ltd ', 'Single', 'Add Later', 'Add Later', 0),
(8, 'BASHUDHARA  MULTI FOOD ', 'Single', 'Add Later', 'Add Later', 59),
(9, 'BASHUDHARA  MULTI STEEL ', 'Single', 'Add Later', 'Add Later', 59),
(10, 'BD SUGAR AND FOOD CASH LC', 'Group', 'Add Later', 'Add Later', 0),
(11, 'BOSUNDORA FOOD AND  BEVERAGE', 'Single', 'Add Later', 'Add Later', 59),
(12, 'DHAKA MATCH FACTORY LTD', 'Group', 'Add Later', 'Add Later', 0),
(13, 'Dressden Textiles Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(14, 'DUTCH BANGLA POWER', 'Group', 'Add Later', 'Add Later', 0),
(15, 'F N FAN INDUSTRIES  LTD', 'Group', 'Add Later', 'Add Later', 0),
(16, 'Global Pac Ind Pvt Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(17, 'GPH ISPAT LTD', 'Group', 'Landview Commercial Center, 8th Floor, 28 Gulshan North, C/A, Gulshan -2, Dhaka-1212', 'Add Later', 0),
(18, 'H H Textile Mills Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(19, 'JALANI SHILPA LTD.', 'Group', 'Add Later', 'Add Later', 0),
(20, 'KAWACHI DETERGENT & CHEMI', 'Group', 'Add Later', 'Add Later', 0),
(21, 'KAYACHI DETERGENT & CH.IND.', 'Group', 'Add Later', 'Add Later', 0),
(22, 'LEEU FASHION LTD ', 'Group', 'Add Later', 'Add Later', 0),
(23, 'ML THREAD  LTD', 'Group', 'Add Later', 'Add Later', 0),
(24, 'MAGPIE COMPOSITE LTD', 'Group', 'Add Later', 'Add Later', 0),
(25, 'MAKS NAHAR LTD ', 'Group', 'Add Later', 'Add Later', 0),
(26, 'MuTUAL CONCERN CORPORATION ', 'Group', 'Add Later', 'Add Later', 0),
(27, 'NAFIZ PAPER ', 'Group', 'Add Later', 'Add Later', 0),
(28, 'PACIFIC A1 SWEATER', 'Group', 'Add Later', 'Add Later', 0),
(29, 'Pacific Shoes  & Bags Ind Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(30, 'Parents  Sweater Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(31, 'Prime Composite Mills Ltd', 'Group', 'Add Later', 'Add Later', 0),
(32, 'Prime Melenge Yarn ltd ', 'Group', 'Add Later', 'Add Later', 0),
(33, 'R R Spinning & Cotton Mills ', 'Group', 'Add Later', 'Add Later', 0),
(34, 'R R SPINNING MILL  ', 'Group', 'Add Later', 'Add Later', 0),
(35, 'RM SYSTEM', 'Group', 'Add Later', 'Add Later', 0),
(36, 'ROCO ENTERPRISE', 'Group', 'Add Later', 'Add Later', 0),
(37, 'Rupshi Feed ', 'Group', 'Add Later', 'Add Later', 0),
(38, 'Samitex Industries Ltd', 'Group', 'Add Later', 'Add Later', 0),
(39, 'SHAHABA YARN LTD ', 'Group', 'Add Later', 'Add Later', 0),
(40, 'Sister Denim Composite  Mills Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(41, 'SISTER DENIM?COMPOSITE UNIT-2', 'Group', 'Add Later', 'Add Later', 0),
(42, 'Sonali Sweater  Ltd ', 'Group', 'Add Later', 'Add Later', 0),
(43, 'SURUJ MIAH TEXTILE', 'Group', 'Add Later', 'Add Later', 0),
(44, 'SWISS QUALITY LTD', 'Group', 'Add Later', 'Add Later', 0),
(45, 'TANZINA FASHION LTD', 'Group', 'Add Later', 'Add Later', 0),
(46, 'THE GLOBAL PACKING IND PVT LTD', 'Group', 'Add Later', 'Add Later', 0),
(47, 'THERMAX BLENDED YARN LTD ', 'Group', 'Add Later', 'Add Later', 57),
(48, 'THERMAX SPINNING LTD ', 'Group', 'Add Later', 'Add Later', 57),
(49, 'THERMAX YARN  DYED FABRICS LTD ', 'Group', 'Add Later', 'Add Later', 57),
(50, 'THERMEX COLOUR COTTON LTD ', 'Group', 'Add Later', 'Add Later', 57),
(51, 'VISTA FIBERS LTD', 'Group', 'Add Later', 'Add Later', 0),
(52, 'ZAKIA COTTONTEX LTD', 'Group', 'Add Later', 'Add Later', 58),
(53, 'MAGPIE KNITWEAR LTD', 'Group', 'Add Later', 'Add Later', 0),
(54, 'Entrust Textile BD Ltd', 'Single', 'à§§à§¦/à§¨, à¦†à¦°à¦¾à¦®à¦¬à¦¾à¦—, à¦®à¦¤à¦¿à¦à¦¿à¦², à¦¢à¦¾à¦•à¦¾<br>à§§à§§/à§¨, à¦…à¦­à§Ÿà¦¦à¦¾à¦¸ à¦²à§‡à¦¨, à¦Ÿà¦¿à¦•à¦¾à¦Ÿà§à¦²à¦¿, à¦¢à¦¾à¦•à¦¾', '02-47110533, 02-9452770', 0),
(55, 'SURAIYA SPINNING MILLS LTD', 'Single', '<p>à¦…à¦¨à¦¾à¦¬à¦¿à¦² à¦Ÿà¦¾à¦“à§Ÿà¦¾à¦° (à§§à§ª à¦“ à§§à§« à¦¤à¦²à¦¾), à¦ªà§à¦²à¦Ÿ à¦¨à¦‚ - à§¦à§©, à¦¬à§à¦²à¦• -à¦à¦¨à¦¡à¦¬à§à¦²à¦¿à¦‰ (à¦œà§‡), à¦—à§à¦²à¦¶à¦¾à¦¨ -à§¨<br></p>', 'à¥¤', 0),
(57, 'THERMAX Group', 'Group', '<p>12nd Floor, Green City Edge, 89, Kakrail, Dhaka 1000</p>', '+88-02-8300492, +88-02-8300493', 0),
(58, 'ZAKIA Group', 'Group', '<p>33 Hatkhola Rd, Dhaka 1203</p>', '+880-2-71216469554846', 0),
(59, 'Bashundhara Group', 'Group', '<p><span>Plot # 25/A, Level -4, Block-A, Bashundhara R/A, Dhaka-1229, Bangladesh</span></p>', '+88028401249~52, +88028401806', 0),
(60, 'SURAIYA SPINNING MILLS LTD', 'Single', '<p>.</p>', '.', 0);

-- --------------------------------------------------------

--
-- Table structure for table `demand_loan_entry`
--

CREATE TABLE `demand_loan_entry` (
  `id` int(11) NOT NULL,
  `company_id` varchar(50) NOT NULL,
  `type` varchar(255) NOT NULL,
  `sanction_no` text NOT NULL,
  `dl_no` varchar(50) NOT NULL,
  `disburse_date` varchar(255) NOT NULL,
  `expiry_date` varchar(50) NOT NULL,
  `loan_creation_amount` varchar(255) NOT NULL,
  `present_outstanding` varchar(50) NOT NULL,
  `total_recovery` varchar(255) NOT NULL,
  `sub_total` varchar(50) NOT NULL,
  `remarks` text NOT NULL,
  `classification` varchar(50) NOT NULL,
  `rf` varchar(255) NOT NULL,
  `register_index_no` varchar(255) NOT NULL,
  `lc_nos` text NOT NULL,
  `lc_amount_usd` varchar(255) NOT NULL,
  `exchange_rate_of_dl` varchar(255) NOT NULL,
  `aggigned_officer` varchar(255) NOT NULL,
  `branch_code` varchar(6) NOT NULL DEFAULT '4006',
  `reason_for_dl` text NOT NULL,
  `latest_state` text NOT NULL,
  `is_demand_loan_active` int(11) NOT NULL DEFAULT 1,
  `loan_documents` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `demand_loan_entry`
--

INSERT INTO `demand_loan_entry` (`id`, `company_id`, `type`, `sanction_no`, `dl_no`, `disburse_date`, `expiry_date`, `loan_creation_amount`, `present_outstanding`, `total_recovery`, `sub_total`, `remarks`, `classification`, `rf`, `register_index_no`, `lc_nos`, `lc_amount_usd`, `exchange_rate_of_dl`, `aggigned_officer`, `branch_code`, `reason_for_dl`, `latest_state`, `is_demand_loan_active`, `loan_documents`) VALUES
(1, '19', 'CASH ', '', '162/9', '1/1/97', '1/1/97', '3468239.00', '2432577.38', '1', '', '', 'WR', '', '', '', '', '', '', '4006', '', '', 1, ''),
(2, '19', 'CASH ', '', '6/98', '3/3/98', '3/3/98', '13987922.55', '2426599.00', '0', '', '', 'WR', '', '', '', '', '', '', '4006', '', '', 1, ''),
(3, '19', 'CASH ', '', '23/99', '27/9/99', '27/9/99', '883995.00', '0.00', '210000', '2400000', '', 'WR', '', '', '', '', '', '', '4006', '', '', 1, ''),
(4, '19', 'CASH ', '', '2/00', '02-07-00', '02-07-00', '2303345.46', '40617620.63', '0', '1.00', '', 'WR', '', '', '', '', '', '', '4006', '', '', 1, ''),
(5, '21', 'cash lc', '', '11/04', '27/7/04', '27/7/04', '1856127.49', '0.00', '0', '0.00', '', 'WR', '', '', '', '', '', '', '4006', '', '', 1, ''),
(6, '20', 'cash lc', '', '.07/13', '25-04-13', '25-04-13', '2246991.82', '0.00', '0', '0.00', '', 'BL', '', '', '', '', '', '', '4006', '', '', 1, ''),
(7, '36', 'cash lc', '', '.19/11', '01-12-11', '01-12-11', '4084773.00', '0.00', '0', '', '', 'W/R', '', '', '', '', '', '', '4006', '', '', 1, ''),
(8, '36', 'cash lc', '', '.20/11', '08-12-11', '08-12-11', '3192101.00', '0.00', '0', '', '', 'W/R', '', '', '', '', '', '', '4006', '', '', 1, ''),
(9, '36', 'cash lc', '', '.22/11', '11-12-11', '11-12-11', '8219028.00', '0.00', '1', '1.00', '', 'W/R', '', '', '', '', '', '', '4006', '', '', 1, ''),
(10, '12', '', '', '22/04', '12-09-04', '12-09-04', '166115.98', '0.00', '0', '0.00', '', 'BL', 'Deleted 04.12.2022', '', '', '', '', '', '4006', '', '', 1, ''),
(11, '43', 'CASH', '', '.03/14', '22-04-14', '22-04-14', '180318658.93', '0.00', '56854252', '56854251.94', '', 'STD /WRITE', '', '', '', '', '', '', '4006', '', '', 1, ''),
(12, '51', 'cash lc', '', '.08/14', '20-11-14', '20-11-14', '44032611.00', '0.00', '2020000', '1980000', '', 'BL', '', '', '', '', '', '', '4006', '', '', 1, ''),
(13, '15', 'cash lc', '', '11/16', '10-03-16', '10-03-16', '12987405.81', '', '9373810', '9373810.00', '', 'BL', 'f: 64 and r: 04', '', '', '', '', '', '4006', '', '', 1, ''),
(14, '35', 'cash lc', '', '43/16', '24-11-16', '24-11-16', '6075029.60', '', '0', '0.00', 'ADJUST :26.12.2022', 'BL', 'f;117r :04', '', '', '', '', '', '4006', '', '', 1, ''),
(15, '11', 'cah LC ', '', '21/17', '28/12/2017', '28/12/2017', '496353872.94', '', '1', '1.00', '', 'J', 'f;160 r :04', '', '', '', '', '', '4006', '', '', 1, ''),
(16, '39', 'cash , R:04/177', '', '10/18', '20-05-18', '20-05-18', '23744881.00', '', '13079061', '', '', ' UC/RES ', 'r :004 f 177', '', '', '', '', '', '4006', '', '', 1, ''),
(17, '39', 'cash lc, R:05/16', '', '1/19', '03-01-19', '08-01-19', '21866000.00', '', '24432000', '24432000.00', '', ' UC ', 'R:05 and F:l16', '', '', '', '', '', '4006', '', '', 1, ''),
(18, '39', 'cash lc, R:05/31', '', '8/19', '07-04-19', '07-04-19', '24182500.00', '', '30027485', '30027485.00', '', ' UC ', 'r 05F and f 31', '', '', '', '', '', '4006', '', '', 1, ''),
(19, '39', 'cash lc, R:05/55', '', '18/19', '15-09-19', '15-09-19', '25397442', '', '25589363', '25589363', '', '', 'R;05/55', '', '', '', '', '', '4006', '', '', 1, ''),
(20, '10', 'cash lc', '', '17/18', '30-06-18', '30-06-18', '1091718171.00', '', '1098861368', '', '', ' UC/GOVT. CORP GRANTEE ', 'r:04 and f 188', '', '', '', '', '', '4006', '', '', 1, ''),
(21, '10', 'cash lc', '', '22/18', '17-09-18', '17-09-18', '894607482.00', '', '697900233', '', '', ' UC/GOVT. CORP GRANTEE ', 'r:04 and f 193', '', '', '', '', '', '4006', '', '', 1, ''),
(22, '10', 'cash lc', '', '23/18', '30-09-18', '30-09-18', '1473381001.80', '', '1649997674', '3446759275.00', '', ' UC/GOVT. CORP GRANTEE ', 'r:04 and f 194', '', '', '', '', '', '4006', '', '', 1, ''),
(23, '28', 'cash lc', '', '36/18', '27-12-18', '27-12-18', '3453437.00', '', '0', '0.00', '', ' SS ', 'f:18 and r:  05', '', '', '', '', '', '4006', '', '', 1, ''),
(24, '14', 'cash lc', '', '2/19', '14-01-19', '14-01-19', '72038002.55', '', '0', '0.00', '', ' UC ', 'f:17 and r 05', '', '', '', '', '', '4006', '', '', 1, ''),
(25, '37', 'cash lc', '', '13/19', '16-05-19', '16-05-19', '50937907.04', '', '75887242', '75887242.18', '', ' UC ', '', '', '', '', '', '', '4006', '', '', 1, ''),
(26, '28', '', '', '', '', '', '', '', '0', '', '', '0', 'f:04.  r: o4', '', '', '', '', '', '4006', '', '', 1, ''),
(27, '37', 'CASH ', '', '1919', '20-10-09', '', '723280', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(28, '37', 'CASH ', '', '1919', '20-10-09', '', '46314964.82', '', '69199371', '69199370.51', '69199370.51', 'bck acmula', '', '', '', '', '', '', '4006', '', '', 1, ''),
(29, '39', 'cash lc, R:05/71', '', '24/19', '02-12-19', '02-12-19', '34868700.42', '', '35803260', '35803260.00', '#REF!', 'r: 05 and f:68', 'r: 05 and f:68', '', '', '', '', '', '4006', '', '', 1, ''),
(30, '40', 'cash lc', '', '.28/19', '29-12-19', '29-12-19', '95946843.16', '', '0', '0.00', '', '', 'R:05/80', '', '', '', '', '', '4006', '', '', 1, ''),
(31, '7', 'cash lc', '', '.31/19', '30-12-19', '30-12-19', '53236054.84', '', '0', '0.00', '', '', 'r:05/86', '', '', '', '', '', '4006', '', '', 1, ''),
(32, '18', 'cash lc', '', ':32/19', '30-12-19', '30-12-19', '113057364.7', '', '0', '0.00', '', '', 'r:05/87', '', '', '', '', '', '4006', '', '', 1, ''),
(33, '18', 'cash lc', '', ':32/19', '30-12-19', '30-12-19', '113057364.7', '', '0', '0.00', '0.00', 'bck acmula', 'r:05/87', '', '', '', '', '', '4006', '', '', 1, ''),
(34, '22', 'Cash Lc ', '', '.10/20', '04-03-20', '04-03-20', '2333690', '', '0', '0', '', '', 'R:05/110', '', '', '', '', '', '4006', '', '', 1, ''),
(35, '22', 'Cash Lc R:04/122', '', '.10/20', '04-03-20', '04-03-20', '152800000', '', '199146108', '199146108', '', 'bck acmula', 'R:05/110', '', '', '', '', '', '4006', '', '', 1, ''),
(36, '2', 'Cas LC ( R05/112)', '', ':11/20', '21-04-20', '21-04-20', '25379500', '', '0', '0', '', '', 'r05/112', '', '', '', '', '', '4006', '', '', 1, ''),
(37, '33', 'Cash Lc ', '', '20/20', '20-09-20', '20-09-20', '40060395.58', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(38, '32', 'cash ', '', ':26/20a (R:06/135)', ':14-10-2020', ':.14-10-2020', '335487583.78', '', '330114068', '0.00', 'STD', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(39, '22', 'Cash ', '', ':27/20', ':15-10-2020', ':15-10-2020', '7387760.62', '', '8677868', '8677868.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(40, '31', 'Cash', '', ':28/20', ':20-10-2020', ':20-10-2020', '350302052.8', '', '363576040', '0.00', 'STD', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(41, '47', 'Cash', '', ':29/20', ':22-10-2020', ':22-10-2020', '419442231.4', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(42, '16', 'Cash', '', ':30/20( Cm )', ':27-10-2020', ':27-10-2020', '', '', '90396955', '0.00', 'TRASFER TO TL  NOV2023', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(43, '30', 'Cash  (R:5:154)', '', ':31/20', ':28-10-2020', ':28-10-2020', '20280549.81', '', '0', '0.00', 'BL', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(44, '16', 'Cash ', '', ':40/20', ':20-12-2020', ':20-12-2020', '28713761', '', '30430516', '0.00', 'TRASFER TO TL  NOV2023', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(45, '6', 'Cash ( R:05/168)', '', ':42/20', ':28-12-2020', ':28-12-2020', '5154000', '', '5674012', '5674012.00', 'BL', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(46, '5', 'Cash ( R:05/169)', '', ':43/20', ':28-12-2020', ':28-12-2020', '7058000', '', '5920717', '5920717.00', 'STD', '15% MORE', '', '', '', '', '', '', '4006', '', '', 1, ''),
(47, '29', 'Cash ( R: 05/172', '', ':44/20', '30-12-20', '30-12-20', '9594948.99', '', '3014157', '3014156.80', 'BL', '', ' MORE THAN 15%', '', '', '', '', '', '4006', '', '', 1, ''),
(48, '42', 'Cash , R:05/173', '', ':45/20', '30-12-20', '30-12-20', '149350500', '', '162309702', '162309702.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(49, '52', 'Cash ', '', ':02/21', ':28-01-2021', ':28-01-2021', '117456911.3', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(50, '26', 'Cash ', '', ':03/21', ':28-01-2021', ':28-01-2021', '34866622.73', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(51, '29', 'cash ', '', ':06/21', '01-03-21', '01-03-21', '7181234.85', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(52, '26', 'cash ', '', ':07/21', ':02-03-2021', ':02-03-2021', '58444088.57', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(53, '52', 'cash ', '', ':08/21', ':02-03-2021', ':02-03-2021', '142307194.2', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(54, '26', 'cash ', '', ':09/21', ':02-03-2021', ':02-03-2021', '323686836.4', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(55, '47', 'cash ', '', ':10/21', ':08-03-2021', ':08-03-2021', '149565787', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(56, '38', 'Cash ', '', ':11/21', ':21-03-2021', ':21-03-2021', '180397050', '', '271306730', '271306730.00', 'STD', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(57, '27', 'CASH ', '', ':12/21', '26-04-21', ':26-04-2021', '85239536.45', '', '85433979', '0.00', 'STD', 'R:05/185', '', '', '', '', '', '', '4006', '', '', 1, ''),
(58, '52', 'CASH ', '', ':13/21', '03-05-21', '03-05-21', '261087120.4', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(59, '29', 'CASH ', '', ':17/21', ':08-062021', ':08-062021', '26850000', '', '30482892', '30482892.00', 'STD', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(60, '3', 'CASH', '', ':18/21', ':22-6-2021', ':22-6-2021', '19236240.74', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(61, '26', 'CASH', '', ':19/21', ':22-6-2021', ':22-6-2021', '171910226.7', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(62, '52', ',CASH', '', ':21/21', ':27-06-2021', ':27-06-2021', '250877075.6', '', '0', '0.00', 'std', '5910300', '', '', '', '', '', '', '4006', '', '', 1, ''),
(63, '47', ',CASH ', '', ':23/21', ':29-07-2021', ':29-07-2021', '325303488', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(64, '50', ',CASH ', '', ':24/21', ':17-08-2021', ':17-08-2021', '32734624.51', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(65, '52', '.CASH', '', ':25/21', ':26-08-2021', ':26-08-2021', '226955474.4', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(66, '50', ',cash', '', ':26/21', ':02-09-2021', ':02-09-2021', '99891161.08', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(67, '13', '.CASH', '', ':28/21', ':08-9-2021', ':08-9-2021', '3062144', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(68, '47', ' ', '', ':32/21', ':16-09-2021', ':16-09-2021', '39870000', '', '0', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(69, '52', ',CASH', '', ':35/21', ':22-09-2021', ':22-09-2021', '305117475.6', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(70, '3', ',CASH', '', ':36/21', ':22-09-2021', ':22-09-2021', '73600121.38', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(71, '29', ',Cash ', '', ':39/21', ':31-10-2021', ':31-10-2021', '19898000', '', '21676430', '21676430.00', 'STD', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(72, '46', ',Cash ', '', ':41/21', ':11-11-2021', ':11-11-2021', '71071050', '', '83538680', '0.00', 'TRASFER TO TL  NOV2023', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(73, '26', ',Cash ', '', ':42/21', ':28-11-2021', ':28-11-2021', '419491394.9', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(74, '52', ',Cash ', '', ':43/21', ':22-12-2021', ':22-12-2021', '157339222.7', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(75, '3', ',Cash ', '', ':44/21', '27-12-21', '27-12-21', '58500000', '', '0', '0.00', 'std', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(76, '45', ',Cash ', '', ':01/22', '11-01-22', '11-01-22', '137600000', '', '139477000', '142827170.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(77, '46', ',Cash ', '', ':04/22', ':23-01-2022', ':23-01-2022', '18619228', '', '21742805', '0.00', 'TRASFER TO TL  NOV2023', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(78, '46', ',Cash ', '', ':05/22', ':23-01-2022', ':23-01-2022', '2933381', '', '3425795', '0.00', 'TRASFER TO TL  NOV2023', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(79, '44', ',CASH ', '', ':09/22', ':27-02-2022', ':27-02-2022', '99606588.79', '', '107490699', '107490698.79', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(80, '52', ',CASH', '', ':10/22', ':28-2-2022', ':28-2-2022', '38318000', '', '19825280', '19825280.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(81, '26', ',CASJH', '', ':13/22', ':08-03-2022', ':08-03-2022', '189762113.6', '', '204328714', '204328713.55', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(82, '29', ',CASH', '', ':17/22', ':06-06-2022', ':06-06-2022', '31306000', '', '28649012', '28649012.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(83, '40', ',CASH', '', ':07/23', ':27-04-2023', ':27-04-2023', '209485865.74', '', '203806616', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(84, '49', ',CASH', '', ':08/23', ':27-04-2023', ':27-04-2023', '103458000', '', '104960300', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(85, '49', ',CASH', '', ':10/23', '10-05-23', '10-05-23', '66451000', '', '67314900', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(86, '52', ',CASH', '', ':13/23', '24-05-23', '24-05-23', '804625102.94', '', '812269103', '812269102.94', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(87, '26', ',CASH', '', ':14/23', '31-05-23', '31-05-23', '722340951.27', '', '727789951', '727789951.27', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(88, '47', ',CASH', '', ':23/23', ':20-07-2023', ':20-07-2023', '77222000.00', '', '77222000', '0.00', 'MODA :', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(89, '1', ',CASH', '', ':24/23', ':20-07-2023', ':20-07-2023', '22814816.78', '', '22814817', '0.00', 'MODA :16.03.2023', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(90, '49', ',CASH', '', ':25/23', ':20-07-2023', ':20-07-2023', '49725900.00', '', '49725900', '0.00', 'MODA :08.05.2023', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(91, '4', ',CASH', '', ':26/23', '30-07-23', '30-07-23', '57716286.75', '', '57716287', '57716286.75', 'N/A', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(92, '34', ',CASH', '', ':27/23', '30-07-23', '30-07-23', '143837664.56', '', '146030215', '146030214.56', 'MODA :07.09.2022', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(93, '24', ',CASH', '', ':32/23', '16-08-23', '16-08-23', '37978046.68', '', '37896667', '37896666.68', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(94, '53', ',CASH', '', ':33/23', '20-08-23', '20-08-23', '32803732.54', '', '33648853', '33648852.54', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(95, '48', 'CASH ', '', ':37/23', '13-09-23', '13-09-23', '255204000.00', '', '255204000', '0.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(96, '25', 'CASH ', '', ':40/23', '13-09-23', '13-09-23', '28876958.96', '', '28974279', '28974278.96', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(97, '23', 'CASH ', '', ':02/24', '08-01-24', '08-01-24', '201543637.00', '', '218994108', '218994108.00', '(MODA: 05.01.2023)', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(98, '9', 'DEFF', '', ':07/24', '09-10-24', '09-10-24', '9423329760.00', '', '2147483647', '10609052803.00', '(MODA: 05.01.2023)', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(99, '8', 'DEFF', '', ':08/24', '09-10-24', '09-10-24', '4573387786.00', '', '2147483647', '5354229510.00', '(MODA: 05.01.2023)', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(100, '41', 'DEFF', '', ':13/24', '05-11-24', '05-11-24', '161081929', '', '183466148', '183466147.98', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(101, '23', 'DEFF', '', ':10/24', '05-11-24', '05-11-24', '71461479', '05-11-24', '76236086', '76236086.18', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(102, '13', 'DEFF', '', ':12/24', '05-11-24', '05-11-24', '56251396', '', '66795646', '66795646.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(103, '13', '                                                                                                                                                                                                                                                               ', '', ':14/24', '05-11-24', '05-11-24', '102481336', '', '109123226', '109123226.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(104, '9', ' ', '', ':11/24', '05-11-24', '05-11-24', '216419265', '', '218252086', '218252086.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(105, '13', 'DEFF', '', ':15/24', '18-11-24', '18-11-24', '39700000', '', '39620000', '39620000.00', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(106, '17', 'DEFF', '', '19/24', '15-12-24', '15-12-24', '2139450409', '', '1073370409', '1073370409.00', '', '', '', '', '', '', '', '', '4006', '', '', 0, ''),
(107, '25', 'DEFF', '', '20/24', '17-12-24', '17-12-24', '91965117.55', '', '92478618', '92478617.55', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(108, '9', 'DEFF', '', ':22/24', ':30-12-2024', ':30-12-2024', '834135214', '', '834135214', '834135214', '', '', '', '', '', '', '', '', '4006', '', '', 1, ''),
(109, '54', 'BTB', '', '42/23 (07/29)', '2023-10-31', '2023-10-31', '10044450.00', '173113423.83', '0', '0', '', '', '', '', '', '', '', '', '4006', '', '', 0, ''),
(110, '55', 'EDF', '', '03/24', '2023-10-02', '0003-10-02', '569643427', '621334397', '0', '621334397', '', '', '', '', '', '', '', '', '4006', '', '', 0, ''),
(111, '1', 'BTB', '', 'DL: 03/24', '2023-12-31', '2027-12-31', '10044450.00', '173113423.83', '0', '2432577.38', '0', 'BL', '', '', '', '', '', '', '4006', '', '', 1, 'uploads/67a98aa8b76c6_International Trade Payment and Finance.pdf'),
(112, '2', '', '', 'DL: 123/22', '', '', '', '', '0', '', '', '', '', '', '', '', '', '', '4006', '', '', 1, 'uploads/67a9907178bcb_IMG_20201103_0003.pdf,uploads/67a990717c8cc_IMG_20201103_0004.pdf,uploads/67a990717d4b4_IMG_20201103_0005.pdf,uploads/67a990717dc27_IMG_20201105_0001.pdf'),
(114, '2', '', '', 'DL:01/24', '', '', '', '', '0', '', '', '', '', '', '', '', '', '', '4006', '', '', 1, 'uploads/67a9c9f19b142_IMG_20210216_0001.pdf,uploads/67a9c9f1a077c_IMG_20210217_0001.pdf,uploads/67a9c9f1a0c9b_IMG_20210218_0001.pdf'),
(116, '7', 'CASH DEFERRED', '', 'DL: 03/24', '2024-10-27', '2027-12-28', '10044450.00', '621334397', '0', '115014464.63', 'MODA:05.01.2023', 'BL', 'R:07, F:35', '', '001155151,00021545', '8555255', '120.6', '', '4006', 'Due to bad loans', 'Party is paying', 1, '[\"uploads\\/67a9cdf38882a_IMG_20201205_0002.pdf\",\"uploads\\/67a9cdf388ec5_IMG_20201207_0001.pdf\",\"uploads\\/67a9cdf38be35_IMG_20201214_0001.pdf\"]'),
(117, '12', 'BACK TO BACK', '', '42/23 (07/29)', '2024-02-01', '2027-12-30', '10044450.00', '115014464.63', '0', '115014464.63', 'MODA:05.01.2023', 'BL', 'R:07, F:35', '', '001155151,00021545', '8555255', '120.6', '', '4006', 'Due to bad loans', 'Party is paying', 1, '[\"uploads\\/67a9cf5d2df55_IMG_20210304_0004.pdf\",\"uploads\\/67a9cf5d2e452_IMG_20210307_0001.pdf\",\"uploads\\/67a9cf5d2e6f2_IMG_20210309_0001.pdf\",\"uploads\\/67a9cf5d2e982_IMG_20210309_0002.pdf\"]'),
(118, '13', 'CASH DEFERRED', '', 'DL: 123/22', '2024-12-23', '2028-04-30', '569643427', '173113423.83', '0', '621334397', 'MODA:05.01.2023', 'BL', 'R:07, F:35', '', '001155151,00021545', '8555255', '120.6', '', '4006', 'Due to bad loans', 'Party is paying', 1, 'uploads/67a9df09342e0_IMG_20220524_0001.pdf,uploads/67a9df0936a12_IMG_20220531_0001.pdf,uploads/67a9df0936fe8_IMG_20220531_0002.pdf,uploads/67a9df09374e4_IMG_20220613_0001.pdf,uploads/67a9df093780e_IMG_20220613_0002.pdf,uploads/67a9df0937b40_IMG_20220703_0001.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `demand_loan_entry_transactions`
--

CREATE TABLE `demand_loan_entry_transactions` (
  `id` int(11) NOT NULL,
  `details` text NOT NULL,
  `demand_loan_id` int(11) NOT NULL,
  `dl_id` int(255) NOT NULL,
  `amount` decimal(25,2) NOT NULL,
  `type` enum('debit','credit') NOT NULL,
  `transaction_date` date NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `demand_loan_entry_transactions`
--

INSERT INTO `demand_loan_entry_transactions` (`id`, `details`, `demand_loan_id`, `dl_id`, `amount`, `type`, `transaction_date`, `created_at`) VALUES
(2, '', 1, 0, 2000323.00, 'credit', '2024-12-23', '2025-01-28 09:53:37'),
(3, '', 2, 0, 32566665.00, 'debit', '2023-03-01', '2025-01-28 09:56:31'),
(4, 'T/L debit', 1, 0, 200000.00, 'debit', '2023-03-29', '2025-01-29 04:56:57'),
(5, 'Demand Loan Disburse', 107, 0, 49262974.75, 'credit', '2024-12-17', '2025-01-29 05:11:55'),
(6, 'Demand Loan Disburse', 107, 0, 42682142.80, 'credit', '2024-12-17', '2025-01-29 05:12:43'),
(7, 'Demand Loan Disburse', 107, 0, 20000.00, 'credit', '2024-12-12', '2025-01-29 05:13:25'),
(8, 'Transfer to Profit and Loss (PL) up to 31.12.2024', 107, 0, 513500.00, 'credit', '2024-03-12', '2025-01-29 05:15:34'),
(9, 'Loan Process Fee', 107, 0, 20000.00, 'credit', '2024-03-12', '2025-01-29 05:16:18'),
(10, 'Demand Loan Disburse', 96, 0, 28876958.96, 'credit', '2023-09-19', '2025-01-29 05:53:37'),
(11, 'Interest on Demand Loan', 96, 0, 97320.00, 'credit', '2023-09-27', '2025-01-29 05:54:50'),
(12, 'This is a test transactions', 3, 0, 500000.00, 'credit', '2024-12-30', '2025-01-30 04:58:13'),
(13, 'This is a test transactions', 26, 0, 5000000.00, 'credit', '2023-11-08', '2025-01-30 05:34:53'),
(20, 'D/L Credit', 1, 0, 100000.00, 'credit', '2024-12-31', '2025-02-13 09:10:43'),
(21, 'Party Debit', 1, 0, 5000.00, 'debit', '2024-11-25', '2025-02-13 09:10:43'),
(22, 'Interest Charge', 1, 0, 10000.00, 'credit', '2024-02-06', '2025-02-13 09:10:43'),
(23, 'Party Debit', 3, 0, 10000.00, 'debit', '2024-12-31', '2025-02-13 09:39:10'),
(24, 'Interest Charge', 3, 0, 100000.00, 'credit', '2024-12-12', '2025-02-13 09:39:10'),
(25, 'D/L Credit', 3, 0, 2000000.00, 'credit', '2024-11-26', '2025-02-13 09:39:10'),
(32, 'Party Debit', 3, 0, 200000.00, 'debit', '2024-12-31', '2025-02-13 09:47:07'),
(33, 'Interest Charge', 3, 0, 10000.00, 'credit', '2024-01-01', '2025-02-13 09:47:07'),
(40, 'Party Debit', 12, 0, 1000000.00, 'debit', '2024-12-31', '2025-02-13 09:53:37'),
(41, 'Interest Charge', 12, 0, 10000.00, 'debit', '2024-12-31', '2025-02-13 09:53:37'),
(42, 'D/L Credit', 12, 0, 2000000.00, 'credit', '2024-12-31', '2025-02-13 09:53:37'),
(43, 'Party Debit', 12, 0, 1000000.00, 'debit', '2024-12-31', '2025-02-13 09:53:51'),
(44, 'Interest Charge', 12, 0, 10000.00, 'debit', '2024-12-31', '2025-02-13 09:53:51'),
(45, 'D/L Credit', 12, 0, 2000000.00, 'credit', '2024-12-31', '2025-02-13 09:53:51');

-- --------------------------------------------------------

--
-- Table structure for table `term_loan`
--

CREATE TABLE `term_loan` (
  `id` int(11) NOT NULL,
  `company_id` int(11) NOT NULL,
  `sanction_no` text NOT NULL,
  `tl_position` varchar(255) NOT NULL,
  `tl_no` varchar(255) NOT NULL,
  `dl_nos` varchar(255) NOT NULL,
  `sanction_date` date NOT NULL,
  `reschedule_date` varchar(255) NOT NULL,
  `reschedule_amount` decimal(15,2) NOT NULL,
  `installment_frequency` int(1) NOT NULL,
  `installment_amount` decimal(15,2) NOT NULL,
  `first_installment_date` date NOT NULL,
  `grace_period` text NOT NULL,
  `grace_period_details` text NOT NULL,
  `last_installment_date` date NOT NULL,
  `special_condition` text NOT NULL,
  `present_outstanding` varchar(255) NOT NULL,
  `total_recovery` varchar(255) NOT NULL,
  `sub_total` varchar(255) NOT NULL,
  `classification` varchar(255) NOT NULL,
  `register_index_no` varchar(255) NOT NULL,
  `reschedule_no` int(255) NOT NULL,
  `lc_type` varchar(255) NOT NULL,
  `passing_authority` varchar(255) NOT NULL,
  `branch_code` varchar(255) NOT NULL DEFAULT '4006',
  `interest_rate` varchar(255) NOT NULL,
  `remarks` varchar(255) NOT NULL,
  `latest_state` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `loan_documents` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `term_loan`
--

INSERT INTO `term_loan` (`id`, `company_id`, `sanction_no`, `tl_position`, `tl_no`, `dl_nos`, `sanction_date`, `reschedule_date`, `reschedule_amount`, `installment_frequency`, `installment_amount`, `first_installment_date`, `grace_period`, `grace_period_details`, `last_installment_date`, `special_condition`, `present_outstanding`, `total_recovery`, `sub_total`, `classification`, `register_index_no`, `reschedule_no`, `lc_type`, `passing_authority`, `branch_code`, `interest_rate`, `remarks`, `latest_state`, `created_at`, `loan_documents`) VALUES
(2, 54, 'à¦¬à§ˆà¦¬à¦¾à¦¬à¦¿/à¦¬à¦¿à¦Ÿà¦¿à¦¬à¦¿/à§§à§¯à§«/à§¨à§¦à§¨à§ª (à§§à¦® à¦ªà§à¦¨à¦ƒà¦¤à¦«à¦¸à¦¿à¦²)', '', '', '', '2024-04-28', '', 173100000.00, 3, 29091668.00, '2024-10-10', '<p>à§¦à§© à¦®à¦¾à¦¸à§‡à¦° à¦—à§à¦°à§‡à¦¸ à¦ªà¦¿à¦°à¦¿à§Ÿà¦¡ à§¨à§© à¦®à¦¾à¦¸ à¦®à§‡à§Ÿà¦¾à¦¦ à§­ à¦Ÿà¦¿ à¦•à¦¿à¦¸à§à¦¤à¦¿<br></p>', '', '2026-04-28', '<p>2 à¦Ÿà¦¿ à¦¤à§à¦°à§ˆà¦®à¦¾à¦¸à¦¿à¦• à¦•à¦¿à¦¸à§à¦¤à¦¿ à¦¬à¦¾ à¦¸à¦®à¦ªà¦°à¦¿à¦®à¦¾à¦¨ à¦Ÿà¦¾à¦•à¦¾ à¦–à§‡à¦²à¦¾à¦ªà¦¿ à¦¹à¦²à§‡ à¦ªà§à¦¨à¦ƒà¦¤à¦«à¦¸à¦¿à¦² à¦¸à§à¦¬à¦¿à¦§à¦¾ à¦¬à¦¾à¦¤à¦¿à¦² à¦¬à¦²à§‡ à¦—à¦¨à§à¦¯ à¦¹à¦¬à§‡à¥¤ <br></p>', '', '', '', '', '', 0, '', '', '', '', '', '', '2025-02-02 08:42:04', ''),
(3, 8, '<p>à¦ªà§à¦°à¦¶à¦¾/à¦¬à§ˆà¦¬à¦¾à¦¬à¦¿/à¦†à¦®à¦¦à¦¾à¦¨à§€(à¦•à§à¦¯à¦¾à¦¶)/à¦®à¦žà§à¦œà¦°à§€/à§§à§¨à§¬à§­/à§¨à§ª</p>', '', '', '', '2024-12-30', '', 10700000.00, 3, 214306307.00, '2025-07-01', '<p>à§¦à§¬ à¦®à¦¾à¦¸à§‡à¦° à¦—à§à¦°à§‡à¦¸ à¦ªà¦¿à¦°à¦¿à§Ÿà¦¡, à§¦à§¬à¦Ÿà¦¿ à¦¤à§à¦°à§ˆà¦®à¦¾à¦¸à¦¿à¦• à¦•à¦¿à¦¸à§à¦¤à¦¿, à§¨ à¦¬à¦›à¦° à¦®à§‡à§Ÿà¦¾à¦¦</p>', '', '2027-08-01', '<p>.<br></p>', '', '', '', '', '', 0, '', '', '', '', '', '', '2025-02-02 11:41:19', ''),
(4, 57, '<p>à¦ªà§à¦°à¦¶à¦¾/à¦¬à§ˆà¦¬à¦¾à¦¬à¦¿/à¦†à¦®à¦¦à¦¾à¦¨à§€(à¦•à§à¦¯à¦¾à¦¶)/à¦®à¦žà§à¦œà¦°à§€/à§¦à§¦à§©/à§¨à§ª<br></p>', '', '', '', '2024-06-25', '', 569700000.00, 3, 95047906.00, '2024-11-13', '<p>à§¦à§© à¦®à¦¾à¦¸ à¦—à§à¦°à§‡à¦¸ à¦ªà¦¿à¦°à¦¿à§Ÿà¦¡à¦¸à¦¹ à§¦à§­ à¦Ÿà¦¿ à¦¤à§à¦°à§ˆà¦®à¦¾à¦¸à¦¿à¦• à¦¸à¦®à¦•à¦¿à¦¸à§à¦¤à¦¿à¦¤à§‡ à§¨à§© à¦®à¦¾à¦¸ à¦®à§‡à§Ÿà¦¾à¦¦à§‡<br></p>', '', '2026-05-13', '<p>.<br></p>', '', '', '', '', '', 0, '', '', '', '', '', '', '2025-02-02 12:55:05', ''),
(5, 27, '<p>à¦ªà§à¦°à¦¶à¦¾/à¦¬à§ˆà¦¬à¦¾à¦¬à¦¿/à¦†à¦®à¦¦à¦¾à¦¨à§€(à¦•à§à¦¯à¦¾à¦¶)/à¦®à¦žà§à¦œà¦°à§€/à§¦à§¦à§ª/à§¨à§ª</p>', '', '', '', '2024-11-07', '', 86200000.00, 1, 4270461.00, '2024-12-05', '<p>à¦ªà§à¦°à¦¦à§‡à§Ÿ à§¨à§©à¦Ÿà¦¿ à¦®à¦¾à¦¸à¦¿à¦• à¦•à¦¿à¦¸à§à¦¤à¦¿à¦¤à§‡ à§¨à§© à¦®à¦¾à¦¸à§‡ à¦ªà¦°à¦¿à¦¶à§‹à¦§à§à¦¯</p>', '', '2026-10-05', '<p>à§¬ à¦Ÿà¦¿ à¦®à¦¾à¦¸à¦¿à¦• à¦•à¦¿à¦¸à§à¦¤à¦¿ à¦¬à¦¾ à¦¸à¦®à¦ªà¦°à¦¿à¦®à¦¾à¦¨ à¦Ÿà¦¾à¦•à¦¾ à¦–à§‡à¦²à¦¾à¦ªà¦¿ à¦¹à¦²à§‡ à¦ªà§à¦¨à¦ƒà¦¤à¦«à¦¸à¦¿à¦² à¦¸à§à¦¬à¦¿à¦§à¦¾ à¦¬à¦¾à¦¤à¦¿à¦² à¦¬à¦²à§‡ à¦—à¦¨à§à¦¯ à¦¹à¦¬à§‡à¥¤</p>', '', '', '', '', '', 0, '', '', '4006', '', '', '', '2025-02-09 08:48:47', ''),
(6, 47, 'à¦ªà§à¦°à¦¶à¦¾/à¦¬à§ˆà¦¬à¦¾/à¦†à¦®à¦¦à¦¾à¦¨à§€(à¦•à§à¦¯à¦¾à¦¶)/à¦®à¦žà§à¦œà¦°à§€/0011/2023', '', '', '', '2023-09-27', '2023-09-25', 1316100000.00, 3, 26000000.00, '2024-06-25', '6', '3', '2029-06-25', '2 à¦Ÿà¦¿ à¦¤à§à¦°à§ˆà¦®à¦¾à¦¸à¦¿à¦• à¦•à¦¿à¦¸à§à¦¤à¦¿ à¦¬à¦¾ à¦¸à¦®à¦ªà¦°à¦¿à¦®à¦¾à¦¨ à¦Ÿà¦¾à¦•à¦¾ à¦–à§‡à¦²à¦¾à¦ªà¦¿ à¦¹à¦²à§‡ à¦ªà§à¦¨à¦ƒà¦¤à¦«à¦¸à¦¿à¦² à¦¸à§à¦¬à¦¿à¦§à¦¾ à¦¬à¦¾à¦¤à¦¿à¦² à¦¬à¦²à§‡ à¦—à¦¨à§à¦¯ à¦¹à¦¬à§‡', '115014464.63', '0', '1539345788', 'BL', 'R:08/13', 0, 'CASH DEFERRED', 'Board of directors in 894th meeting', '4006', 'SMART+3%', '1', 'Party is paying', '2025-02-13 06:38:57', 'No Files Added');

-- --------------------------------------------------------

--
-- Table structure for table `term_loan_entry_transactions`
--

CREATE TABLE `term_loan_entry_transactions` (
  `id` int(11) NOT NULL,
  `details` text NOT NULL,
  `term_loan_id` int(11) NOT NULL,
  `amount` decimal(25,2) NOT NULL,
  `type` enum('debit','credit') NOT NULL,
  `transaction_date` date NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `term_loan_entry_transactions`
--

INSERT INTO `term_loan_entry_transactions` (`id`, `details`, `term_loan_id`, `amount`, `type`, `transaction_date`, `created_at`) VALUES
(1, 'BF R-7, P/29 ', 2, 173113423.83, 'credit', '2024-04-28', '2025-02-02 10:22:27'),
(2, 'Deposit', 2, 1000000.00, 'debit', '2024-09-02', '2025-02-02 10:23:56'),
(3, 'MODA intt. ', 2, 11886567.00, 'credit', '2024-09-04', '2025-02-02 10:24:42'),
(4, 'Interest on D/L', 2, 16162800.00, 'credit', '2024-09-22', '2025-02-02 10:26:01'),
(5, 'Credit First Installment', 2, 2602332.00, 'debit', '2024-10-29', '2025-02-02 10:26:49'),
(6, 'Interest adjust', 2, 98188.00, 'credit', '2024-11-12', '2025-02-02 10:27:53'),
(7, 'BF R-7, P/90', 3, 2139450409.00, 'credit', '2024-12-15', '2025-02-02 11:43:35'),
(8, 'Down payment (D/P)', 3, 65000000.00, 'debit', '2024-12-15', '2025-02-02 11:44:46'),
(9, 'TR From CC A/C', 3, 280000000.00, 'debit', '2024-12-23', '2025-02-02 11:46:20'),
(10, 'TR From CC A/C', 3, 661100000.00, 'debit', '2024-12-26', '2025-02-02 12:00:03'),
(11, 'TR From CC A/C', 3, 60000000.00, 'debit', '2024-12-29', '2025-02-02 12:00:34'),
(12, 'Interest upto 31.12.2024', 3, 10671812.00, 'credit', '2024-12-30', '2025-02-02 12:01:46'),
(13, 'TR Form Margin', 3, 3000000.00, 'debit', '2024-12-30', '2025-02-02 12:02:23'),
(14, 'TR From CC A/C', 3, 7671812.00, 'debit', '2024-12-30', '2025-02-02 12:02:56'),
(15, 'Loan Process Fee', 3, 20000.00, 'credit', '2024-12-30', '2025-02-02 12:03:25'),
(16, 'BF R-05, P-185', 5, 86200000.00, 'credit', '2024-12-30', '2025-02-09 08:55:36'),
(17, 'Interest upto 30.09.2024', 5, 1523090.00, 'credit', '2024-12-30', '2025-02-09 08:57:00'),
(18, 'Interest upto 31.12.2024', 5, 2926566.00, 'credit', '2024-12-30', '2025-02-09 08:58:58'),
(20, 'Credit First Installment', 5, 1100000.00, 'debit', '2025-01-30', '2025-02-09 09:00:55'),
(21, 'Array', 5, 1.00, '', '0000-00-00', '2025-02-13 08:33:17'),
(23, 'D/L Credit', 6, 10000.00, 'debit', '2024-12-25', '2025-02-13 08:41:54'),
(24, 'Party Debit', 6, 5000.00, 'credit', '2024-12-31', '2025-02-13 08:41:54');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('Admin','User') NOT NULL DEFAULT 'User'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `role`) VALUES
(1, 'ashik', '$2y$10$y/4xjJozy95x3amQngA9dO4t.1skAWbxolGXu40Iu/VtvyS08EsSm', 'Admin'),
(2, 'monir', '$2y$10$lNmIc9PO76QXlKKO2glOduuWxblQtGRsAbbUqFx0i9tSPX2c2odEu', 'Admin'),
(5, 'azad', '$2y$10$l8caJtow2v95ZKgF1yqA.uS8C7swOxvGf1Aybpse7Fn5um/9YNPHO', 'Admin'),
(6, 'bhaktear', '$2y$10$WMMpuIt18QJvlMN5Kx11uebx5lZZbRbvpVXS6xMq8SN8Yc.EpAqTy', 'Admin');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `companies`
--
ALTER TABLE `companies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `demand_loan_entry`
--
ALTER TABLE `demand_loan_entry`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `demand_loan_entry_transactions`
--
ALTER TABLE `demand_loan_entry_transactions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `term_loan`
--
ALTER TABLE `term_loan`
  ADD PRIMARY KEY (`id`),
  ADD KEY `demand_loan_id` (`company_id`);

--
-- Indexes for table `term_loan_entry_transactions`
--
ALTER TABLE `term_loan_entry_transactions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `companies`
--
ALTER TABLE `companies`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- AUTO_INCREMENT for table `demand_loan_entry`
--
ALTER TABLE `demand_loan_entry`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=119;

--
-- AUTO_INCREMENT for table `demand_loan_entry_transactions`
--
ALTER TABLE `demand_loan_entry_transactions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT for table `term_loan`
--
ALTER TABLE `term_loan`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `term_loan_entry_transactions`
--
ALTER TABLE `term_loan_entry_transactions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `term_loan`
--
ALTER TABLE `term_loan`
  ADD CONSTRAINT `term_loan_ibfk_1` FOREIGN KEY (`company_id`) REFERENCES `demand_loan_entry` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
